# Pandas 基礎介紹

## 匯入資料
* https://raw.githubusercontent.com/Code-Gym/python-dataset/master/u.user.txt
* read_csv
* 分隔符號(sep)
* 索引欄位(index_col)

In [1]:
import pandas as pd
users = pd.read_csv('https://raw.githubusercontent.com/Code-Gym/python-dataset/master/u.user.txt',
                   sep='|',
                   index_col='user_id')

## 列印前五筆資料

In [2]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

## 列印後五筆資料

In [7]:
users.tail()

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

## 資料筆數

In [8]:
users.shape[0]

943

## 欄位數量

In [9]:
users.shape[1]

4

## 欄位名稱和資料型態

In [11]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## 指定欄位

In [17]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

## 列印職業欄中的第一筆資料

In [18]:
users.occupation[1]

'technician'

## 職業欄中，有多少不同種類的職業

In [19]:
users.occupation.nunique()

21

## 每一種職業的統計數量有多少？

In [20]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

## 出現次數最高的職業是哪一種職業？

In [21]:
users.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

## 出現次數最少的是哪一種職業？

In [22]:
users.occupation.value_counts().tail(1)

doctor    7
Name: occupation, dtype: int64

## 基本統計資料

In [23]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## 全部欄位基本統計資料

In [24]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN